const TERMS = `<b>歡迎使用 TG Lover</b>

請仔細閱讀這些使用條款 （即「條款」）。這些條款管理並適用於你透過 TG Lover 聊天機械人應用程式（統稱為「服務」）存取與使用 TG Lover 的社交網絡服務，你一旦存取或使用我們的服務，即表示你同意接受這些條款和細則的約束。如果你不同意全部的條款和細則，請不要使用我們的服務。

<b>使用服務</b>

TG Lover 允許你透過 Telegram 跟你的朋友存取、瀏覽並分享更新資料。只要你遵守這些條款，你就有權使用服務。在任何情況下你都不可以 (i) 解編、逆向工程、拆解或製作 TG Lover 或服務的衍生作品；(ii) 透過任何方法修改 TG Lover 或服務的功能讓多人使用；或 (iii) 以任何非法方式、任何非法目的或以任何不符合本條款的方式使用本服務。

享用 TG Lover 服務，即代表您確認並同意：
• TG Lover 沒有義務要對應用程式提供維護和支援服務。
• 應用程式供應商並不負責解決你提出的任何申索，或任何第三方跟此應用程式或你擁有並使用此應用程式提出的任何申索，其中包括，但不限於：(i) 產品的法律責任申索；(ii) 此應用程式未能遵守適用法律或監管規定的任何申索；及(iii) 根據消費者保護法或類似法例所提出的申索。

我們的服務每隔一段時間就會更改，及/或我們可能停止（永遠或暫時）提供此服務（或服務的功能），有可能不會事先通知你。我們服務的某些功能可能會受附加條款及細則的約束，我們會將這些條款及細則隨這些功能一起公佈。

<b>在 TG Lover 上建立帳戶</b>
為了存取並使用 TG Lover，你需要註冊並建立一個帳戶（你的「帳戶」）。建立帳戶之後，即表示你已達法定年齡，可以簽訂具有約束力的合約，而非是一個在香港特別行政區或其他適用管轄權法律下禁制接受服務的個人。在建立帳戶時，你可能需要提供某些關於你自己的個人資料，然後務必建立一個 Telegram 使用者名稱。關於你的帳戶，你同意提供準確、最新並完備的個人資料。

建立帳戶時，請不要：
• 提供任何虛假的個人資料給我們或未得到他人的允許就為他人建立帳戶。
• 意圖冒充他人，而使用他人的個人資料。
• 未得到他人適當授權，而使用受他人權利規限的個人資料；或
• 使用具有冒犯性、 粗俗、淫穢或其他低劣品味的個人資料。

如果你在註冊的過程中所提供的資料，事後證實為不準確、虛假或有誤導性，我們保留中止或停止你的帳戶，或索回你透過本服務所建立違反我們條款的個人資料的權利。你應該將你的 Telegram 密碼和帳戶保密，且同意若你的密碼遺失、失竊或被揭露給未獲授權的第三方或以其他方式被盜用，將會通知我們。你對在你的帳戶下所發生的活動負責。

<b>私隱政策</b>
關於我們是如何從用戶那裡蒐集、使用與披露資訊，請查閱我們的私隱政策。

<b>內容提交</b>
我們的服務允許你和其他使用者張貼、連結、儲存和以某些方法提供資訊、影像、錄像、文字及/或其他內容 （「內容」）。你對你張貼在服務上的內容負責，包括其合法性、可靠性和適當性。將內容張貼到服務上之後，就表示你授與我們權利與許可在我們的服務上和透過我們的服務使用、修改、公開張貼、公開展示、複製與分發這類內容。你同意此授權可包括讓我們有權利可將你的內容提供給本服務的其他使用者，他們也可以受這些條款約束使用你的內容。對於你在本服務或透過本服務所提交、張貼或展示的任何內容，你保留任何和所有你的權利，並且你要負責保護這些權利。

你可以移除在本服務上張貼的內容，透過刻意刪除操作即可。但是，在某些情況下，一些內容（例如你張貼的內容或評論）可能無法完全移除，你的一些內容的副本可能會繼續存留在本服務內及/或別處。對於移除或刪除本服務上的任何內容，我們不承擔法律上的責任。

你聲明並保證：(i) 內容是你的 （你擁有它）或你有權使用它，並授予我們這些條款所規定的權利和許可。並且，(ii) 在本服務或透過本服務張貼你的內容，並不違反私隱權、宣傳權、版權, 合約權或任何人的任何其他權利。

在張貼內容和使用本服務時，我們請你尊重我們的線上社群和其他使用者。在提交內容到服務上，或以其他方式使用服務時，你同意不會：
• 提交侵犯第三方所有權權利的材料，包括私隱權和宣傳權，或侵犯任何適用的法律；
• 發佈可能使我們、我們的使用者或任何第三方蒙受損害的虛假或不實陳述的內容；
• 發佈某人任何私人資料，例如是他們的地址、電話號碼、電子郵件地址及類似的資料，卻未得到他們的允許；
• 提交的材料是非法的、淫褻的、有損他人名譽的、誹謗的、威脅性的、色情的、騷擾的、憎恨的、冒犯他人種族的或鼓勵被視為刑事犯罪、引起民事法律責任、違反任何法律或其他不適當的行為；
• 張貼廣告或銷售產品；
• 冒充他人或聲稱隸屬我們，或是我們的員工或其他行業的專家；
• 唆使取得使用者密碼或其他帳戶的資訊；或
• 大量蒐集其他人資料以達到任何目的。

這份清單只是一個示例，目的不在於完整，也不排除其他可能。我們沒有義務監督你存取或使用本服務或審核或編輯任何內容，但是為了經營服務業務我們有權如此做，以確保你遵守這些條款，或遵守適用的法律或命令或法院、行政機構或其他政府機構的規定。我們保留此權利，在任何時間未經事先通知，依據我們的酌情決定權，若我們認為你的行為違反這些條款，或對本服務有害，即會移除或禁止你對任何內容的存取。

<b>服務提供的內容</b>
透過本服務提供的內容，並未經過我們審查、核實或認證，可能含有不準確或虛假的資訊。
我們不會就服務或服務中的任何內容與服務中所包含的內容的品質、適用性、真實性、準確性或完整性作出任何陳述、保證或擔保。你對因使用或依賴任何內容而引起的風險要承擔全部的責任。

<b>版權政策</b>
在本服務上，我們不允許侵犯版權和侵犯知識產權的活動存在，我們會刪除任何已知悉、侵犯他人知識產權的內容 。如果你是版權擁有人或其代理人，並且認為內容侵犯了你的版權，你可以提交一份通知到：@internal_server_error 並以書面形式提供以下資料:

• 一份代表版權擁有者行事的授權代理人的電子或實體簽署；
• 一份你聲稱受侵犯的版權作品說明，包括版權作品所在位置的URL （亦即網頁地址）或一份版權作品。
• 你聲稱侵犯版權的材料的明確URL位置或在本服務的其他明確位置。
• 你的姓名、地址、電話號碼和電子郵件地址；
• 你作出的聲明，保證你有充分理由相信有爭議的材料使用並未經版權持有人、其代理人或法律許可。
• 你以版權擁有者或授權代理人的名義聲明保證上述訊息正確真實，否則將承擔偽證罪刑責。

<b>未獲授權的活動</b>
我們的服務只能用在合法的用途。你同意在使用或存取本服務時，不會有以下的行為：(i) 透過使用任何引擎、軟體、工具、代理軟體、設備或機制（包括蜘蛛、機器人、爬行器、資料採礦工具或類似機制），企圖存取或搜尋本服務或從本服務下載內容，而不使用由我們提供的軟體及/或搜索代理程式或其他一般常用的第三方網頁瀏覽器；(ii) 存取、篡改或使用本服務的非公共區域、我們的電腦系統或我們供應商的技術交付系統；(iii) 蒐集和使用資訊，例如透過本服務取得其他使用者的名稱、真實名字、電子郵件地址，用來傳遞任何未經請求的廣告、垃圾郵件、兜售垃圾郵件或其他形式的招攬邀約；(iv) 使用本服務，做為商業用途或謀求任何第三方的利益，或不符合這些條款的使用方法；(v) 違反任何適用的法律或規例；或(vi) 鼓勵或使任何其他個人得以做上述的任何事。我們保留對上述任何侵犯行為進行調查和起訴的權利，及/或與執法當局合作，起訴違反這些條款的使用者。

<b>賠償</b>
若因你或任何使用你帳戶的人在使用本服務時，侵犯任何適用法律或法規或任何第三方的權利，你同意負責賠償，當遭受第三方的任何索賠或要求時讓我們免於承擔任何與所有損害、損失、法律責任和費用（包括律師費用）。

<b>連結第三方網站</b>
本服務可能含有指向其他並非我們操作的網站和服務的連結。我們提供這些連結只是為了方便起見，對於顯示在這些網站上的內容或連結我們並不負任何責任。你負責並承擔使用或依賴任何第三方網站所產生的全部風險。

<b>擁有權</b>
@internal_server_error 獨家擁有此應用程式和服務的一切權利、所有權和權益，包括全部相關的知識產權。你不得移除、更改或遮蓋在應用程式或服務中所包含的任何版權、商標、服務標章或其他專有權利聲明, 包括任何內容。你知道並同意，你可能提供關於應用程式或服務的任何回饋、評論或建議 （”回饋”） 將是 @internal_server_error 的專屬財產, 你會將你擁有的全部權利、所有權和權益分配給我們。

<b>終止服務</b>
如果你違反了這些條款中的任何條款，我們有權暫停或禁止你存取或使用本應用程式及/或本服務。

<b>免責聲明</b>
你理解並同意, 本應用程式和本服務是按照「現況」及「現有」基礎提供給你的。在無上述限制的情況下, 我們明確否認任何對適售性、特定用途的適用性、安靜享受或未侵權的保證， 以及交易過程或營商過程中所產生的任何保證。我們不保證本應用程式或本服務會滿足你的要求，或能在不間斷、安全或無錯誤的基礎上提供給你使用。

<b>一般條款</b>
這些條款受香港特別行政區法律管轄，未考慮任何法律規則或原則的衝突。我們未能執行這些條款的任何權利或條文，將不被視為放棄這些權利。如果這些條款的任何條文被法院裁定為無效或無法執行, 則這些條款的其他條文將繼續有效。這些條款構成了我們之間關於我們的服務的整個協議, 並取代和替代先前我們之間關於本服務的任何協議。我們可能每隔一段時間就會修訂這些條款, 並會在任何新條款生效前，儘量最少在7天之前進行通知。在這些修訂生效後，你若繼續存取或使用我們的服務，即表示你同意接受修訂條款的約束。`;

const USERNAME_PERMISSION_CONFIRM = (username: string) => `TG Lover 已經取得了您的 Telegram 帳戶名稱：
@${username}

是否同意 TG Lover 使用這個 Telegram 帳戶名稱為您進行交友配對？

您的 Telegram 帳戶名稱只會用作成功配對後雙方交換帳戶，並不會用於其他用途。

如您日後更改了 Telegram 帳戶名稱，因為 TG Lover 沒有權限直接存取您的 Telegram 帳戶名稱，您必須透過 /renew 命令通知 TG Lover 更新您用作配對的 Telegram 帳戶名稱。

請注意：如您刻意更改了 Telegram 帳戶名稱而不主動通知 TG Lover，當成功進行配對後對方不能聯絡您，對方有權對您作出檢舉。

(您必須同意才能使用 TG Lover 服務)`;

const AGREE_TERMS = "同意上述條款";

const DISAGREE_TERMS = "不同意上述條款";

const AGREE = "同意";
const DISAGREE = "不同意";

const DISAGREE_TERMS_ERROR = "非常抱歉，因為您不同意上述條款，TG Lover 將不能為您服務😔";

const DISAGREE_USERNAME_PERMISSION_ERROR = "非常抱歉，因為您不同意 TG Lover 使用您的帳戶名稱，TG Lover 將不能為您服務😔";

const YOUR_USER_INFO = "您的自我介紹";

const USER_INFO_SCHEMA = `現在，您可以使用以下 YAML 格式模板寫下關於您的自我介紹，完成自我介紹後方可使用 TG Lover 進行配對。您必須以 \\\#自我介紹 作開頭。

\`\`\`yaml
#自我介紹
暱稱: XXX (必填)
性別: 男 | 女 (必填選項)
年齡: 13-99 (必填，必須為數字)
身高: 140-220 (必填，必須為數字)
尋找對象關係: 結婚對象 | 穩定關係 | 短期關係 (必填選項)
是否吸煙: 經常吸煙 | 間中吸煙 | 不吸煙 (必填選項)
職業: 任意字串 (選填)
月入: 任意數字 (單位 HKD，選填，最少值 0，最大值 100000000)
學歷: 小學 | 中學 | 大專 | 學士 | 碩士 | 博士 (選填選項)

自我介紹:
- 我是。。。
- 我喜歡。。。
- 我的興趣是。。。
(至少一段，最多十段)

尋找對象:
- 樣靚
- 身材正
- 人品好
(至少一項，最多十項)
\`\`\`

以下是自我介紹例子，你可以直接複製再作修改，然後回覆：
`;

const USER_INFO_SAMPLE = `#自我介紹
暱稱: 小強
性別: 男
年齡: 20
身高: 160
尋找對象關係: 穩定關係
是否吸煙: 不吸煙
職業: 高級軟件攻城獅
月入: 100000
學歷: 學士

自我介紹:
- 我是一位IT狗
- 我喜歡狗
- 我的興趣是做狗

尋找對象:
- 樣靚
- 身材正
- 人品好`;

const USER_INFO_FORMAT_ERROR = "您輸入的格式有誤，請修正後再重新回覆。";
const USER_INFO_VALIDATION_ERROR = "您的資料有誤，請修正後再重新回覆";

const USER_INFO_UPDATED = `您的自我介紹已更新完成😊`;

const ASK_FOR_PHOTOS = "現在可以上傳 1-5 張您的個人照片 (如有)，直接在訊息欄上傳則可，或是按下方按鈕略過。";
const SKIP_THIS_STEP = "略過此步驟";

const MAX_UPLOAD_PHOTO_ERROR = "最多只能上傳5張照片\n您可以使用 /clear_photos 清除所有個人照片，並重新上傳。";

const USER_PHOTOS_UPDATED = "已為您更新{x}張個人照片😊\n如你想刪除現有照片，您可以使用 /clear_photos 清除所有個人照片，然後再上傳一次。\n如果以完成此步驟，請按下方「下一步」按鈕。";
const USER_PHOTOS_CLEARED = "您已清除所有個人照片！";

const NEXT_STEP = "下一步";

const FILTER_SCHEMA = `現在，您可以使用以下 YAML 格式模板寫下關於您的配對條件，完成配對條件後方可使用 TG Lover 進行配對。您必須以 \\\#配對條件 作開頭。

\`\`\`yaml
#配對條件
性別: 異性 | 同性 | 不限 (必填)
年齡: XX或以下 | XX-YY | YY或以上 | 不限 (必填，以歲為單位)
身高: XX或以下 | XX-YY | YY或以上 | 不限 (必填，必須為數字，以 cm 為單位)
\`\`\`

以下是配對條件例子，你可以直接複製再作修改，然後回覆：
`;

const FILTER_SAMPLE = `#配對條件
性別: 異性
年齡: 18-22
身高: 150-160
`;

const GOTO_NEXT_STEP_IF_UPLOAD_FINISHED = "如果您確定已上傳完成所有個人照片，請按下方「下一步」按鈕。";

const YOUR_FILTER = "您的配對條件";

const USER_FILTER_UPDATED = `您的配對條件已更新完成😊`;

const REGISTER_FINISHED = "恭喜您，您已完成註冊，您現在可以用 /match 進行配對。";

export const RegisterMessage = Object.freeze({
    TERMS,
    AGREE,
    DISAGREE,
    AGREE_TERMS,
    DISAGREE_TERMS,
    DISAGREE_TERMS_ERROR,
    USERNAME_PERMISSION_CONFIRM,
    DISAGREE_USERNAME_PERMISSION_ERROR,
    USER_INFO_SCHEMA,
    USER_INFO_SAMPLE,
    YOUR_USER_INFO,
    USER_INFO_FORMAT_ERROR,
    USER_INFO_VALIDATION_ERROR,
    USER_INFO_UPDATED,
    ASK_FOR_PHOTOS,
    SKIP_THIS_STEP,
    MAX_UPLOAD_PHOTO_ERROR,
    USER_PHOTOS_UPDATED,
    USER_PHOTOS_CLEARED,
    NEXT_STEP,
    FILTER_SCHEMA,
    FILTER_SAMPLE,
    GOTO_NEXT_STEP_IF_UPLOAD_FINISHED,
    YOUR_FILTER,
    USER_FILTER_UPDATED,
    REGISTER_FINISHED,
});
